<script>
  import Slide from '$lib/Slide.svelte';
</script>

<Slide>
  <h1>状態フレームワークとMVCについて</h1>
  <h2>状態管理フレームワークとMVCの関係</h2>
  <ul>
    <li>MVCはあくまでコード分離のパターンである</li>
    <li>近年、一方で、State=Modelだとしている人がいる</li>
    <li>
      きちんと設計するなら、状態を一つの巨大な部分にするのではなく、入力状態と、アプリケーションの状態などにしっかり分離すべき
    </li>
  </ul>
  <h2>状態管理フレームワークはUIコンポーネントでの更新伝搬をうまくやりたい</h2>
  <ul>
    <li>UIコンポーネントの内部の状態伝搬</li>
    <li>UIコンポーネントどうしの状態更新伝搬</li>
    <li>
      課題としては、UIフレームワークライブラリから独立しているため、状態管理フレームワークの更新伝搬のための仕組みを意識しなければならない
    </li>
  </ul>
</Slide>
