<script>
  import Slide from '$lib/Slide.svelte';
</script>

<Slide>
  <h1>UIの課題に対処するには</h1>
  <ul>
    <li>
      設計が大事
      <ul>
        <li>UIのコードを上手に分割する</li>
        <li>分割したコードを上手に組み合わせる</li>
      </ul>
    </li>
    <li>
      フレームワークを使うだけでは解決しない
      <ul>
        <li>フレームワークは、よくある課題解決パターンを抽象化して一貫させる</li>
        <li>しかし、望ましい設計とパターンがかみ合わないと地獄になる</li>
        <li>UIフレームワークは、そのパターンの表現力できることに制限される</li>
        <li>UI自体の表現力はもっと多様にあり、ユーザの欲求により更に開拓される余地がある</li>
        <li>きちんと設計することが重要</li>
      </ul>
    </li>
  </ul>
</Slide>
